
#Область ПрограммныйИнтерфейс

Процедура ВыполнитьСценарий() Экспорт
	
	ВыполнитьАнализСинтаксическогоКонтроля(ВыходнойФайл, ФайлСинтаксическогоКонтроля, ФайлСОбъектамиКонфигурации);
	
КонецПроцедуры

Функция ТипПараметра(ИмяПараметра) Экспорт
	Типы = Перечисления.ТипыПараметров;
	Если ИмяПараметра = "ВыходнойФайл" Тогда
		Возврат Типы.Файл;
	ИначеЕсли ИмяПараметра = "ВыходнойФайл" Тогда
		Возврат Типы.Файл;
	ИначеЕсли ИмяПараметра = "ВыходнойФайл" Тогда
		Возврат Типы.Файл;
	КонецЕсли;
КонецФункции


#КонецОбласти

#Область ОбработчикиСобытий



#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ВыполнитьАнализСинтаксическогоКонтроля(ВыходнойФайл, ФайлСинтаксическогоКонтроля, ФайлСОбъектамиКонфигурации)
	
	Объекты = Новый ТекстовыйДокумент;
	Объекты.Прочитать(ФайлСОбъектамиКонфигурации);
	ОбъектыБезПереносов = СтрЗаменить(Объекты.ПолучитьТекст(), Символы.ПС, "");
	СК = Новый ТекстовыйДокумент;
	СК.Прочитать(ФайлСинтаксическогоКонтроля);
	
	тНайденныеОбъекты = Новый ТаблицаЗначений;
	тНайденныеОбъекты.Колонки.Добавить("Объект");
	
	Для сч = 1 По СК.КоличествоСтрок() Цикл
		Строка = СК.ПолучитьСтроку(сч);
		Строка = СтрЗаменить(Строка, "Переменная не определена (", Символы.ПС);
		Если СтрЧислоСтрок(Строка) = 1 Тогда
			Продолжить;
		КонецЕсли;
		ИмяОбъекта = СтрПолучитьСтроку(Строка, 2);
		ИмяОбъекта= СтрЗаменить(ИмяОбъекта, ")", "");
		
		Конфигурация = СтрЗаменить(ОбъектыБезПереносов, ">"+ИмяОбъекта+"</", Символы.ПС);
		Конфигурация = СтрПолучитьСтроку(Конфигурация, 2);
		Поз = Найти(Конфигурация, ">");
		ТипОбъекта = Лев(Конфигурация, Поз-1);
		тНайденныеОбъекты.Добавить().Объект = "<xr:Item xsi:type=""xr:MDObjectRef"">"+ ТипОбъекта + "." + ИмяОбъекта + "</xr:Item>";
	КонецЦикла;
	
	тНайденныеОбъекты.Свернуть("Объект");
	
	ВыходнойДокумент = Новый ТекстовыйДокумент;
	Для Каждого Строка Из тНайденныеОбъекты Цикл
		ВыходнойДокумент.ДобавитьСтроку(Строка.Объект);
		Сообщить(Строка.Объект);
	КонецЦикла;
	
	ВыходнойДокумент.Записать(ВыходнойФайл);

КонецПроцедуры

#КонецОбласти






