
&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "*" Тогда
		ДобавитьПроцедуруНаСервере(Параметр, Источник);
	КонецЕсли;
КонецПроцедуры


Процедура ДобавитьПроцедуруНаСервере(ИмяПроцедуры, ЭтоНачалоПроцедуры)
	Если ОтключитьЗамер Тогда
		Возврат;
	КонецЕсли;
	
	ТабличныйДокумент = Объект.ДеревоВызовов;
	Если ЭтоНачалоПроцедуры = Истина Тогда
		ТабличныйДокумент.Область(ТабличныйДокумент.ВысотаТаблицы+1, 1).Текст = ИмяПроцедуры;
		ТабличныйДокумент.НачатьГруппуСтрок(ИмяПроцедуры);
	Иначе
		Попытка
			ТабличныйДокумент.ЗакончитьГруппуСтрок();
		Исключение
		КонецПопытки;
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура Очистить(Команда)
	Объект.ДеревоВызовов.Очистить();
КонецПроцедуры


&НаСервере
Процедура ФорматироватьНаСервере()
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ФорматироватьТабличныйДокументСДеревомВызовов(Объект.ДеревоВызовов);
КонецПроцедуры


&НаКлиенте
Процедура Форматировать(Команда)
	ФорматироватьНаСервере();
КонецПроцедуры

