
#Область ПрограммныйИнтерфейс

Процедура ВыполнитьСценарий() Экспорт
	
	ВыполнитьСинтаксическийКонтроль(ПутьК1С, КаталогИБ, ПользовательИБ, ПарольИБ, ФайлСлужебныхСообщений);
	
КонецПроцедуры

Функция ТипПараметра(ИмяПараметра) Экспорт
	Типы = Перечисления.ТипыПараметров;
	Если ИмяПараметра = "ПутьК1С" Тогда
		Возврат Типы.Файл;
	ИначеЕсли ИмяПараметра = "КаталогИБ" Тогда
		Возврат Типы.Каталог;
	ИначеЕсли ИмяПараметра = "ПользовательИБ" Тогда
		Возврат Типы.Логин;
	ИначеЕсли ИмяПараметра = "ПарольИБ" Тогда
		Возврат Типы.Пароль;
	ИначеЕсли ИмяПараметра = "ФайлСлужебныхСообщений" Тогда
		Возврат Типы.Файл;
	КонецЕсли;
КонецФункции


#КонецОбласти

#Область ОбработчикиСобытий



#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ВыполнитьСинтаксическийКонтроль(ПутьК1С, КаталогИБ, ПользовательИБ, ПарольИБ, ФайлСлужебныхСообщений)
	
	Команда = "%ПутьК1С%   DESIGNER  /F %КаталогИБ% /N %ПользовательИБ% /P %ПарольИБ% "
		+ " /DisableStartupDialogs "
		+ " /CheckConfig -ThinClient -Server -ThickClientOrdinaryApplication "
		+ " /Out %ФайлСлужебныхСообщений% "
		;
		
	Команда = ПакетныйРежим.ОбернутьВКавычкиКоманду(Команда);
	
	Команда = СтрЗаменить(Команда, "%ПутьК1С%", ПутьК1С);
	
	Команда = СтрЗаменить(Команда, "%КаталогИБ%", КаталогИБ);
	Команда = СтрЗаменить(Команда, "%ПользовательИБ%", ПользовательИБ);
	Команда = СтрЗаменить(Команда, "%ПарольИБ%", ПарольИБ);
	
	Команда = СтрЗаменить(Команда, "%ФайлСлужебныхСообщений%", ФайлСлужебныхСообщений);
		
	
	ПакетныйРежим.ВыполнитьИзКоманднойСтроки(Команда);

КонецПроцедуры

#КонецОбласти






