
&НаКлиенте
Процедура Преобразовать(Команда)
	ВыполнитьАнализСинтаксическогоКонтроля();
КонецПроцедуры


Процедура ВыполнитьАнализСинтаксическогоКонтроля()
	
	Объекты = Новый ТекстовыйДокумент;
	//Объекты.Прочитать(ФайлСОбъектамиКонфигурации);
	Объекты.УстановитьТекст(Объект.ИсходноеДеревоКонфигурации);
	ОбъектыБезПереносов = СтрЗаменить(Объекты.ПолучитьТекст(), Символы.ПС, "");
	СК = Новый ТекстовыйДокумент;
	СК.УстановитьТекст(Объект.РезультатКонтроля);
	
	тНайденныеОбъекты = Новый ТаблицаЗначений;
	тНайденныеОбъекты.Колонки.Добавить("Объект");
	
	Для сч = 1 По СК.КоличествоСтрок() Цикл
		Строка = СК.ПолучитьСтроку(сч);
		Строка = СтрЗаменить(Строка, "Переменная не определена (", Символы.ПС);
		Если СтрЧислоСтрок(Строка) = 1 Тогда
			Продолжить;
		КонецЕсли;
		ИмяОбъекта = СтрПолучитьСтроку(Строка, 2);
		ИмяОбъекта= СтрЗаменить(ИмяОбъекта, ")", "");
		
		Конфигурация = СтрЗаменить(ОбъектыБезПереносов, ">"+ИмяОбъекта+"</", Символы.ПС);
		Конфигурация = СтрПолучитьСтроку(Конфигурация, 2);
		Поз = Найти(Конфигурация, ">");
		ТипОбъекта = Лев(Конфигурация, Поз-1);
		тНайденныеОбъекты.Добавить().Объект = "<"+ ТипОбъекта + ">" + ИмяОбъекта + "</"+ ТипОбъекта + ">";
	КонецЦикла;
	
	тНайденныеОбъекты.Свернуть("Объект");
	
	ВыходнойДокумент = Новый ТекстовыйДокумент;
	Для Каждого Строка Из тНайденныеОбъекты Цикл
		ВыходнойДокумент.ДобавитьСтроку(Строка.Объект);
		Сообщить(Строка.Объект);
	КонецЦикла;
	
	Объект.СтрокаОбъекты = ВыходнойДокумент.ПолучитьТекст();

КонецПроцедуры