
#Область ПрограммныйИнтерфейс

Процедура ВыполнитьСценарий() Экспорт
	
	ОбновитьКонфигурациюБазыДанных(ПутьК1С, КаталогИБ, ПользовательИБ, ПарольИБ);
	
КонецПроцедуры

Функция ТипПараметра(ИмяПараметра) Экспорт
	Типы = Перечисления.ТипыПараметров;
	Если ИмяПараметра = "ПутьК1С" Тогда
		Возврат Типы.Файл;
	ИначеЕсли ИмяПараметра = "КаталогИБ" Тогда
		Возврат Типы.Каталог;
	ИначеЕсли ИмяПараметра = "ПользовательИБ" Тогда
		Возврат Типы.Логин;
	ИначеЕсли ИмяПараметра = "ПарольИБ" Тогда
		Возврат Типы.Пароль;
	КонецЕсли;
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытий



#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОбновитьКонфигурациюБазыДанных(ПутьК1С, КаталогИБ, ПользовательИБ, ПарольИБ)
	Команда = "%ПутьК1С%   DESIGNER   %КаталогИБ% /N %ПользовательИБ% /P %ПарольИБ% "
		+"  /UpdateDBCfg ";
		
	Команда = СтрЗаменить(Команда, "%ПутьК1С%", ПутьК1С);
	
	Команда = СтрЗаменить(Команда, "%КаталогИБ%", КаталогИБ);
	Команда = СтрЗаменить(Команда, "%ПользовательИБ%", ПользовательИБ);
	Команда = СтрЗаменить(Команда, "%ПарольИБ%", ПарольИБ);
	
	ПакетныйРежим.ВыполнитьИзКоманднойСтроки(Команда);
		
КонецПроцедуры


#КонецОбласти




