Перем СчетчикВложенностиСекций Экспорт;

Процедура ПриНачалеРаботыСистемы()
	СброситьСчетчик();
	
	
	//Ссылка = Справочники.Профили.НайтиПоКоду("000000034");
	//ОткрытьЗначение(Ссылка);
	
	//Обработки.ПостроениеДереваПроцедур.ПолучитьФорму().Открыть();
	
	//ПутьКОбработке = "C:\Users\yur\Desktop\Временные\СборкаКонфигураций_дерево.epf";
	//ВнешниеОбработки.ПолучитьФорму(ПутьКОбработке, "ФормаО").Открыть();
	
	
	//Обработки.АнализСинтаксическогоКонтроля.ПолучитьФорму().Открыть();
	
	//Обработки.ПодготовкаКонфигурацииКПостроениюДереваВызоваПроцедур.ПолучитьФорму().Открыть();
КонецПроцедуры










Процедура НачалоСекции(ИмяСекции) Экспорт
	Префикс = Лев(	 "																"
					+"																"
					+"																"
					, СчетчикВложенностиСекций);
	Сообщить(Префикс + "- " +ИмяСекции);
	СчетчикВложенностиСекций=СчетчикВложенностиСекций+1;
КонецПроцедуры

Процедура КонецСекции() Экспорт
	СчетчикВложенностиСекций=СчетчикВложенностиСекций-1;
КонецПроцедуры

Процедура СброситьСчетчик() Экспорт
	СчетчикВложенностиСекций = 0;
КонецПроцедуры
