
Процедура ВыполнитьОбработкуТекста() Экспорт
	
	ОбработанныйТекстовыйДокумент = Новый ТекстовыйДокумент;
	ОбработанныйТекстовыйДокумент.УстановитьТекст(ИсходныйТекст);
	
	
	Для сч=1 По ОбработанныйТекстовыйДокумент.КоличествоСтрок() Цикл
		Строка = ОбработанныйТекстовыйДокумент.ПолучитьСтроку(сч);
		Строка = СокрЛ(Строка);
		Если Найти(НРег(Строка), "процедура") = 1 Тогда
			ОбработканнаяСтрока = ПодставитьНачалоСекцииВСтроку(Строка);
		ИначеЕсли Найти(НРег(Строка), "функция") = 1 Тогда
			ОбработканнаяСтрока = ПодставитьНачалоСекцииВСтроку(Строка);
		ИначеЕсли Найти(НРег(Строка), "конецпроцедуры") = 1 Тогда
			ОбработканнаяСтрока = ПодставитьКонецСекцииВСтроку(Строка);
		ИначеЕсли Найти(НРег(Строка), "конецфункции") = 1 Тогда
			ОбработканнаяСтрока = ПодставитьКонецСекцииВСтроку(Строка);
		ИначеЕсли Найти(НРег(Строка), "возврат") = 1 Тогда
			ОбработканнаяСтрока = ПодставитьКонецСекцииВСтроку(Строка);
		Иначе
			Продолжить;
		КонецЕсли;
		
		ОбработанныйТекстовыйДокумент.ЗаменитьСтроку(сч, ОбработканнаяСтрока);
	КонецЦикла;
	
	ОбработанныйТекст = ОбработанныйТекстовыйДокумент.ПолучитьТекст();
	
КонецПроцедуры

Функция ПодставитьНачалоСекцииВСтроку(ИсходнаяСтрока)
	
	ОбработаннаяСтрока = "" + ИсходнаяСтрока;
	
	ПозицияПервогоПробела = Найти(ИсходнаяСтрока, " ");
	ПозицияОткрывающейСкобки = Найти(ИсходнаяСтрока, "(");
	ИмяПроцедурыФункции = Сред(ИсходнаяСтрока, ПозицияПервогоПробела, ПозицияОткрывающейСкобки - ПозицияПервогоПробела);
	ИмяПроцедурыФункции = СокрЛП(ИмяПроцедурыФункции);
	
	Возврат ИсходнаяСтрока + " " + "НачалоСекции("""+ИмяПроцедурыФункции+"()"");";
	
КонецФункции

Функция ПодставитьКонецСекцииВСтроку(ИсходнаяСтрока)
	Возврат "КонецСекции(); " +ИсходнаяСтрока;
КонецФункции
