
#Область ПрограммныйИнтерфейс

Процедура ВыполнитьСценарий() Экспорт
	
	ВыгрузитьКонфигурациюВФайл(ПутьК1С, КаталогИБ, ПользовательИБ, ПарольИБ, ФайлВыгрузкиКонфигурации);
	
КонецПроцедуры

Функция ТипПараметра(ИмяПараметра) Экспорт
	Типы = Перечисления.ТипыПараметров;
	Если ИмяПараметра = "ПутьК1С" Тогда
		Возврат Типы.Файл;
	ИначеЕсли ИмяПараметра = "КаталогИБ" Тогда
		Возврат Типы.Каталог;
	ИначеЕсли ИмяПараметра = "ПользовательИБ" Тогда
		Возврат Типы.Логин;
	ИначеЕсли ИмяПараметра = "ПарольИБ" Тогда
		Возврат Типы.Пароль;
	ИначеЕсли ИмяПараметра = "ФайлВыгрузкиКонфигурации" Тогда
		Возврат Типы.Файл;
	КонецЕсли;
КонецФункции


#КонецОбласти

#Область ОбработчикиСобытий



#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ВыгрузитьКонфигурациюВФайл(ПутьК1С, КаталогИБ, ПользовательИБ, ПарольИБ, ФайлВыгрузкиКонфигурации)
	
	Команда = "%ПутьК1С%   DESIGNER  /F %КаталогИБ% /N %ПользовательИБ% /P %ПарольИБ% "
		+ " /DisableStartupDialogs "
		+ " /DumpCfg %ФайлВыгрузкиКонфигурации% ";
		
	Команда = ПакетныйРежим.ОбернутьВКавычкиКоманду(Команда);
	
	Команда = СтрЗаменить(Команда, "%ПутьК1С%", ПутьК1С);
	
	Команда = СтрЗаменить(Команда, "%КаталогИБ%", КаталогИБ);
	Команда = СтрЗаменить(Команда, "%ПользовательИБ%", ПользовательИБ);
	Команда = СтрЗаменить(Команда, "%ПарольИБ%", ПарольИБ);
	
	Команда = СтрЗаменить(Команда, "%ФайлВыгрузкиКонфигурации%", ФайлВыгрузкиКонфигурации);
		
	
	ПакетныйРежим.ВыполнитьИзКоманднойСтроки(Команда);

КонецПроцедуры

#КонецОбласти






