
&НаСервере
Процедура ВыполнитьОбработкуНаСервере()
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	
	МассивМасок = ОбработкаОбъект.РазложитьСтрокуВМассивПодстрок(Объект.МаскиФайлов, Символы.ПС);
	ОбработкаОбъект.СкопироватьФайлыОбъектовПоМассивуМасок(МассивМасок);
	ОбработкаОбъект.ПодставитьМеткиВФайлы(Объект.КаталогСборки);
	ОбработкаОбъект.СоздатьРеестрЗагружаемыхФайлов(Объект.КаталогСборки);
	ОбработкаОбъект.ЗагрузитьКонфигурациюИзФайлов(
						ОбработкаОбъект.КаталогБазы, 
						ОбработкаОбъект.ПользовательБазы,
						ОбработкаОбъект.КаталогСборки, 
						ОбработкаОбъект.РеестрЗагружаемыхФайлов);
	
	ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект");
	
	Сообщить("Готово");
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьОбработку(Команда)
	ВыполнитьОбработкуНаСервере();
КонецПроцедуры

&НаКлиенте
Функция ПолучитьПутьККаталогу()
	
	ДиалогФыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	ДиалогФыбораФайла.Заголовок = "Выберите каталог";
	Если ДиалогФыбораФайла.Выбрать() Тогда
		Возврат ДиалогФыбораФайла.Каталог;
	КонецЕсли;	
	
КонецФункции

&НаКлиенте
Процедура КаталогНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ВыбранныйПуть = ПолучитьПутьККаталогу();
	Если ВыбранныйПуть = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Объект[Элемент.Имя] = ВыбранныйПуть;
КонецПроцедуры


