
#Область ПрограммныйИнтерфейс

Процедура ВыполнитьИзКоманднойСтроки(Команда) Экспорт
	
	КодВозврата = Неопределено;
	ЗапуститьПриложение(Команда, КаталогПрограммы(), Истина, КодВозврата);
	Если КодВозврата = Неопределено Тогда
		КодВозврата = "Неопределено";
	КонецЕсли;
	
	Сообщение = "[Код возврата: " + КодВозврата + "] : " + Команда;
	Логирование.ЗаписатьЛог(Сообщение);
	
	Если НЕ КодВозврата = 0 Тогда
		ВызватьИсключение Сообщение;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ОбернутьВКавычкиКоманду(знач Команда) Экспорт
	Команда = " " + Команда + " ";
	Команда = СтрЗаменить(Команда, " %", " ""%");
	Команда = СтрЗаменить(Команда, "% ", "%"" ");
	Возврат СокрЛП(Команда);
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции



#КонецОбласти



