


#Область ПрограммныйИнтерфейс

Процедура ВыполнитьСценарий() Экспорт
	
	СобратьКонфигурациюИзФайлов(ПутьК1С, КаталогИБ, КаталогРазобраннойКонфигурации);
	
КонецПроцедуры

Функция ТипПараметра(ИмяПараметра) Экспорт
	Типы = Перечисления.ТипыПараметров;
	Если ИмяПараметра = "ПутьК1С" Тогда
		Возврат Типы.Файл;
	ИначеЕсли ИмяПараметра = "КаталогИБ" Тогда
		Возврат Типы.Каталог;
	ИначеЕсли ИмяПараметра = "КаталогРазобраннойКонфигурации" Тогда
		Возврат Типы.Каталог;
	КонецЕсли;
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытий



#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура СобратьКонфигурациюИзФайлов(ПутьК1С, КаталогИБ, КаталогРазобраннойКонфигурации);
	Команда = "%ПутьК1С%   DESIGNER  –force /F %КаталогИБ% "
		+ " /DisableStartupDialogs "
		+ " /LoadConfigFromFiles  %КаталогРазобраннойКонфигурации%";
		
	Команда = ПакетныйРежим.ОбернутьВКавычкиКоманду(Команда);
	
	Команда = СтрЗаменить(Команда, "%ПутьК1С%", ПутьК1С);
	Команда = СтрЗаменить(Команда, "%КаталогИБ%", КаталогИБ);
	Команда = СтрЗаменить(Команда, "%КаталогРазобраннойКонфигурации%", КаталогРазобраннойКонфигурации);
	
	ПакетныйРежим.ВыполнитьИзКоманднойСтроки(Команда);
		
КонецПроцедуры

#КонецОбласти
