
#Область ПрограммныйИнтерфейс

Процедура ВыполнитьСценарий() Экспорт
	
	ЗапуститьОбработкуПодготовкиСборки();
	
КонецПроцедуры

Функция ТипПараметра(ИмяПараметра) Экспорт
	
	Типы = Перечисления.ТипыПараметров;
	Если ИмяПараметра = "ФайлОписанияКонфигурации" Тогда
		Возврат Типы.Файл;
	ИначеЕсли ИмяПараметра = "ФайлОписанияЗаглушек" Тогда
		Возврат Типы.Файл;
	ИначеЕсли ИмяПараметра = "КаталогСборки" Тогда
		Возврат Типы.Каталог;
	ИначеЕсли ИмяПараметра = "КаталогИсходныхФайлов" Тогда
		Возврат Типы.Каталог;
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытий



#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ЗапуститьОбработкуПодготовкиСборки()
	
	//Обработка = ВнешниеОбработки.Создать(ПутьКОбработкеПоСборке, Ложь);
	Обработка = Обработки.СборкаКонфигураций.Создать();
	
	ЗаполнитьЗначенияСвойств(Обработка, ЭтотОбъект);
	
	Обработка.ВыполнитьСборкуКонфигурации();
	
КонецФункции

#КонецОбласти

