
#Область ПрограммныйИнтерфейс

Процедура ВыполнитьСценарий() Экспорт
	
	СоздатьФайловуюБазу1С(ПутьК1С, КаталогИБ);
	
КонецПроцедуры

Функция ТипПараметра(ИмяПараметра) Экспорт
	Типы = Перечисления.ТипыПараметров;
	Если ИмяПараметра = "ПутьК1С" Тогда
		Возврат Типы.Файл;
	ИначеЕсли ИмяПараметра = "КаталогИБ" Тогда
		Возврат Типы.Каталог;
	КонецЕсли;
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытий



#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура СоздатьФайловуюБазу1С(ПутьК1С, КаталогИБ)
	
	УдалитьФайлы(КаталогИБ);
	
	Команда = "%ПутьК1С%   CREATEINFOBASE File= %КаталогИБ%";
		
	Команда = ПакетныйРежим.ОбернутьВКавычкиКоманду(Команда);
	
	Команда = СтрЗаменить(Команда, "%ПутьК1С%", ПутьК1С);
	Команда = СтрЗаменить(Команда, "%КаталогИБ%", КаталогИБ);
	
	ПакетныйРежим.ВыполнитьИзКоманднойСтроки(Команда);
	
КонецПроцедуры

#КонецОбласти







